app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "1999-08-07"], ["color", "white"], ["name", "Theodore"], ["sex", "f"], ["created_at", "2019-02-26 22:19:50.462323"], ["updated_at", "2019-02-26 22:19:50.462323"]]
---
  def create
    @cat = Cat.new(cats_param)
    if @cat.save